{"id": "payload_000008", "important": {"title": "Account Takeover - Web Vulnerabilities (XSS, Smuggling, CSRF, JWT, Unicode)", "category": "Account Takeover", "sub_category": "Web Vulnerabilities", "tags": ["xss", "csrf", "http-request-smuggling", "jwt", "unicode", "session", "cookies"], "targets": {"os": ["Any"], "system": ["Web App", "Subdomains", "API Gateways"]}, "risk": "critical"}, "variants": [{"match": {"os": ["Any"], "system": ["Web App"]}, "payload": "Find XSS on subdomain where cookies are scoped to parent domain; inject script to exfiltrate session cookie and authenticate as user.", "notes": "Cross-Site Scripting can leak session tokens when cookie scope is broad."}, {"match": {"os": ["Any"], "system": ["Proxy", "Load Balancer"]}, "payload": "Use smuggler to detect CL/TE request smuggling and craft requests to overwrite server-side routing resulting in account takeover.", "notes": "HTTP Request Smuggling can lead to mass ATO (see public reports)."}, {"match": {"os": ["Any"], "system": ["Web App"]}, "payload": "Create HTML form with auto-submit to change password (CSRF) and deliver to victim while authenticated.", "notes": "CSRF can perform state-changing actions if anti-CSRF protections absent."}, {"match": {"os": ["Any"], "system": ["Auth Service"]}, "payload": "Edit JWT payload to swap user id/email or test weak JWT signature algorithms (none/HS256 key reuse).", "notes": "Weak JWT signing/config can allow forging tokens for other users."}, {"match": {"os": ["Any"], "system": ["Web App"]}, "payload": "Register visually-similar unicode email/account (e.g., demⓞ@gmail.com) to bypass normalization and collide with victim (use Unisub to find characters).", "notes": "Unicode normalization/case-mapping issues can cause account confusion and takeover."}], "usage": {"steps": ["Enumerate web vulnerabilities (XSS, CSRF, request smuggling, JWT misconfig).", "Exploit the easiest path to obtain session or reset credentials (cookie theft, forged JWT, CSRF reset).", "Use exfiltrated tokens or forged credentials to access victim account."], "required_params": {"vulnerable_url": {"required": true, "example": "https://sub.example.com/vuln"}, "attacker_host": {"required": false, "example": "http://attacker.com"}}, "mitigations": ["Scope cookies narrowly (per-subdomain) and enable HttpOnly/Secure flags.", "Add XSRF tokens and SameSite cookie protections.", "Fix XSS vulnerabilities; sanitize outputs and use CSP.", "Harden proxies/load balancers against request smuggling and patch HTTP parsing inconsistencies.", "Use strong JWT signing and rotate keys; validate alg and claims server-side.", "Normalize unicode input and apply strict validation on account identifiers."], "references": ["HTTP Request Smuggling reports (Slack, Zomato) - Aug 30, 2020", "Unisub / Unicode pentester cheatsheets", "HackerOne public reports on request smuggling"]}, "system": {"version": "2.0.0", "source": "PayloadsAllTheThings"}}
